Step4-blockMesh/confluenceBlockMesh/0.orig/U
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii; 	
 class volVectorField; 	
 location "0"; 	
 object U; 	
}

dimensions [ 0 1 -1 0 0 0 0 ];

internalField uniform (0 0 0); 	

boundaryField
{

	mitis
	{ 
		type surfaceNormalFixedValue;
		//refValue uniform -0.3944; //10 m3/s
		refValue uniform -0.1972; //5 m3/s
	}

	neigette
	{ 
		type surfaceNormalFixedValue;
		refValue uniform -0.3125; //10 m3/s
	}

	downstream
	{ 
    		type 		inletOutlet;
    		inletValue 	uniform (0 0 0);
    		value 		uniform (0 0 0);
	}

  	top
  	{
		type symmetryPlane;
  	}
  
  	"wall_.*"
  	{
        	type            fixedValue;
        	value           uniform (0 0 0);
  	}
}
// ************************************************************************* //
