Step4-blockMesh/confluenceBlockMesh/0.orig/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    mitis
    {
        type            fixedValue;
        value           uniform 0;
    }

    neigette
    {
        type            fixedValue;
        value           uniform 0;
    }
    downstream
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }
    wall_bathy
    {
        type            fixedValue;
        value           uniform 0;
    }

    top
    {
        type            symmetryPlane;
    }
    
    "proc.*"
    {
        type            processor;
    }
}


// ************************************************************************* //
