Step4-blockMesh/confluenceBlockMesh/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{

	mitis
	{ 
		type            zeroGradient;
	}

	neigette
	{ 
		type            zeroGradient;
	}

	downstream
	{ 
        type            fixedValue;
        value           uniform 0;
	}

  	top
  	{
		type symmetryPlane;
  	}
  
  	"wall_.*"
  	{
        type            zeroGradient;
  	}
}

// ************************************************************************* //
