Step4-blockMesh/confluenceBlockMesh/0.orig/s
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      s;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    mitis
    {
        type            fixedValue;
        value           uniform 0;
    }
    
    neigette
    {
        type            fixedValue;
        value           uniform 1;
    }

    downstream
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }

    "wall_.*"
    {
        type            zeroGradient;
    }

    top
    {
        type            symmetryPlane;
    }

}