Step4-blockMesh/confluenceBlockMesh/Allrun
#!/bin/bash

blockMesh