Step4-blockMesh/confluenceBlockMesh/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-6;
        relTol          0.05;

        smoother        GaussSeidel;

        //nCellsInCoarsestLevel 50;
    }

    pFinal
    {
         $p;
        smoother        DICGaussSeidel;
        tolerance       1e-06;
        relTol          0;
    }

    /*"(U|k|B|nuTilda|epsilon|s)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-7;
        relTol          0;
    }*/
    "(U|k|B|nuTilda|s)"
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-05;
        relTol          0;
    }
}

/*SIMPLE
{
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;

    residualControl
    {
        p               1e-5;
        U               1e-5;
        nuTilda         1e-5;
    }
}*/


PISO
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
}

/*relaxationFactors
{
    "U.*"               1;
    "nuTilda.*"         1;
}*/


// ************************************************************************* //
